smq100/inish-stm32cube-template/Application/ClassB/src/classb.c
/*!
 ******************************************************************************
 * @copyright Copyright (c) 2026 Inish Corporation
 *
 * SPDX-License-Identifier: MIT
 *
 * Permission is hereby granted, free of charge, to any person obtaining a
 * copy of this software and associated documentation files (the "Software"),
 * to deal in the Software without restriction, including without limitation
 * the rights to use, copy, modify, merge, publish, distribute, sublicense,
 * and/or sell copies of the Software, and to permit persons to whom the
 * Software is furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
 * FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 *
 ******************************************************************************

 @file    classb.c
 @brief   Source file for ClassB functionality
 @author  Steve Quinlan
          Portions adapted from STMicroelectronics Class B library
          https://www.st.com/en/embedded-software/stm32-classb-spl.html
 @date    2026-March

 ******************************************************************************/

#define CLASSB_PROTECTED

#include "main.h"
#include "task.h"
#include "task_system.h"
#include "task_led.h"
#include "classb.h"
#include "classb_startup.h"
#include "classb_vars.h"
#include "classb_params.h"
#include "log.h"
#include "eeprom_mcu.h"
#include "util.h"
#include "timer.h"
#include "dma.h"
#include "adc.h"
#include "stm32l1xx_ll_adc.h"

/* Private typedef -----------------------------------------------------------*/

typedef struct
{
  bool Enabled;                      ///!< Indicates whether the startup test is enabled
  bool PreInit;                      ///!< Indicates whether the test should run during pre-initialization
  bool Always;                       ///!< Indicates whether the test should always run regardless of previous results
  fnClassBHandler_Startup* Handler;  ///!< Function pointer to the test handler
  const char* Name;                  ///!< Name of the startup test
} tClassbStartConfig;

typedef struct
{
  bool Enabled;      ///!< Indicates whether the run test is enabled
  const char* Name;  ///!< Name of the run test
} tClassbRunConfig;

/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Public variables ----------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

static const char* _Module = "CLSB";  //!< Module Name for debug logging

static bool _FaultInjection[eClassBRunItem_NUM] = { false };  //!< Fault injection flags

// clang-format off
// Order must match tClassBStartItem enum
static const tClassbStartConfig _StartConfig[] = {
  { true, true,  true,  Start_Init1,     "sInit1" },
  { true, true,  false, Start_Init2,     "sInit2" },
  { true, true,  false, Start_RAMTest,   "sRAM" },
  { true, true,  false, Start_CPUTest,   "sCPU" },

#ifndef TEST__DISABLE_IWDG
  { true, false, false, Start_IWDGTest,  "sIWDG" },
#else
  { false, false, false, Start_IWDGTest, "sIWDG" },
#endif

  { true, false, false, Start_CRCTest,   "sCRC" },
  { true, false, false, Start_CLKTest,   "sCLK" },
  { true, false, false, Start_ADCTest,   "sADC" },
  { true, false, false, Start_UARTTest,  "sUART" },
  { true, false, false, Start_FLOWTest,  "sFlow" },
  { true, false, true,  Start_Complete,  "sComplete" },
};

// Order must match tClassBRunItem enum
static const tClassbRunConfig _RunConfig[] = {
  { true, "rCPU" },
  { true, "rRAM" },
  { true, "rCRC" },
  { true, "rADC" },
  { true, "rCLK" },

#ifndef TEST__DISABLE_IWDG
  { true, "rWDG" },
#else
  { false, "rWDG" },
#endif

  { true, "rStack" },
  { true, "rApp" },
  { true, "rFlow" },
};
// clang-format on

static_assert(sizeof(_StartConfig) / sizeof(tClassbStartConfig) == eClassBStartItem_NUM, "start size mismatch");
static_assert(sizeof(_RunConfig) / sizeof(tClassbRunConfig) == eClassBRunItem_NUM, "run size mismatch");

static const uint32_t _WdgExpectedMagic = 0x57444754u;  // 'WDGT'

static bool _IwdgDisabled = false;
static uint32_t _WdgHeartbeatMask = 0u;
static bool _StarveWdg = false;  ///< Force IWDG reset

// Startup test status (stored in .noinit RAM section so preserved across sw resets)
static uint32_t _StartTestStatus[eClassBStartItem_NUM] __attribute__((section(".noinit")));

/* Private function prototypes -----------------------------------------------*/
static uint32_t _RtcBkupRead(uint32_t BackupRegister);
static void _RtcBkupWrite(uint32_t BackupRegister, uint32_t Data);

/* Public Implementation -----------------------------------------------------*/

/*******************************************************************/
/*!
 @brief     Initializes ClassB variables
 @param     force : true to force initialization of variables, false to only initialize if not already set
             (e.g. from previous classb startup test before reset)
 @return    Status indicating whether variables were initialized (true) or
            preserved from previous run (false)
 *******************************************************************/
bool ClassB_InitVars(bool Force)
{
  bool reset = false;
  uint32_t reset_cause = Force ? 0 : GetResetCause();

  if (reset_cause & RCC_CSR_SFTRSTF)
  {
    // Software reset detected; ignore
  }
  else if (reset_cause & RCC_CSR_IWDGRSTF)
  {
    // IWDG reset detected; ignore
  }
  else
  {
    for (int i = 0; i < eClassBStartItem_NUM; i++)
    {
      _StartTestStatus[i] = TEST_CLASSB_NOINIT;
    }

    for (int i = 0; i < eClassBRunItem_NUM; i++)
    {
      _FaultInjection[i] = false;
    }

    // Clear RAM test status in RTC backup register
    RTC_HandleTypeDef hrtc = { 0 };
    hrtc.Instance = RTC;
    static_assert(RTC_RAMCHECK_STATUS_REG <= RTC_BKP_DR4);
    (void)HAL_RTCEx_BKUPWrite(&hrtc, RTC_RAMCHECK_STATUS_REG, TEST_CLASSB_NOINIT);

    reset = true;
  }

