smq100/inish-stm32cube-template/Application/ClassB/src/classb.c
  // Make sure all tests have a valid state regardless of reset cause
  for (int i = 0; i < eClassBStartItem_NUM; i++)
  {
    if (!_StartConfig[i].Enabled)
    {
      _StartTestStatus[i] = TEST_CLASSB_DISABLED;
    }
    else if (_StartTestStatus[i] == TEST_CLASSB_NOINIT)
    {
      // Ignore
    }
    else if (_StartTestStatus[i] == TEST_CLASSB_INPROGRESS)
    {
      // Ignore
    }
    else if (_StartTestStatus[i] == TEST_CLASSB_PASS)
    {
      // Ignore
    }
    else if (_StartTestStatus[i] == TEST_CLASSB_FAIL)
    {
      // Ignore
    }
    else
    {
      _StartTestStatus[i] = TEST_CLASSB_NOINIT;
    }
  }

  return reset;
}

/*******************************************************************/
/*!
 @brief     Performs ClassB startup tests
 @param     PreInit : true to run pre-initialization tests
                      false to run post-initialization tests
 @return    None
*******************************************************************/
void ClassB_DoStartUpTests(bool PreInit)
{
  for (tClassBStartItem i = 0; i < eClassBStartItem_NUM; i++)
  {
    if (_StartConfig[i].PreInit != PreInit)
    {
      // Skip tests not matching the preInit specification
    }
    else if (_StartTestStatus[i] == TEST_CLASSB_PASS && !_StartConfig[i].Always)
    {
      printf("Skipping startup test previously PASSED: %s\n\r", _StartConfig[i].Name);
    }
    else if (_StartTestStatus[i] == TEST_CLASSB_FAIL && !_StartConfig[i].Always)
    {
      printf("Skipping startup test previously FAILED: %s\n\r", _StartConfig[i].Name);
      break;
    }
    else
    {
      printf("Running startup test: %s (pre=%d)\n\r", _StartConfig[i].Name, PreInit);
      bool success = _StartConfig[i].Handler(_StartConfig[i].Enabled, &_StartTestStatus[i]);
      _StartTestStatus[i] = success ? TEST_CLASSB_PASS : TEST_CLASSB_FAIL;

      if (success)
      {
        printf("Startup test PASSED: %s\n\r", _StartConfig[i].Name);
      }
      else
      {
        ClassB_Fail_Startup(i);  // Does not return. TODO?
      }
    }
  }
}

/*******************************************************************/
/*!
 @brief   Returns whether specified startup test passed
 @param   test : Test to check
 @return  true if test passed, false otherwise
*******************************************************************/
bool ClassB_IsStartupPass(tClassBStartItem Test)
{
  if (Test >= eClassBStartItem_NUM)
  {
    return false;
  }
  return (_StartTestStatus[Test] == TEST_CLASSB_PASS);
}

/*******************************************************************/
/*!
 @brief   Returns whether all startup tests passed
 @param
 @return  true if all tests passed, false otherwise
*******************************************************************/
bool ClassB_IsAllStartupPass(void)
{
  bool success = true;
  for (tClassBStartItem i = 0; i < eClassBStartItem_NUM; i++)
  {
    if (_StartConfig[i].Enabled && (_StartTestStatus[i] != TEST_CLASSB_PASS))
    {
      success = false;
      break;
    }
  }

  return success;
}

/*******************************************************************/
/*!
 @brief   Disables IWDG for testing purposes
 @param   None
 @return  None
*******************************************************************/
void ClassB_ExpireIWDG(void)
{
  printf("Disabled IWDG. Waiting for reset...\r\n");
  _IwdgDisabled = true;
}

/*******************************************************************/
/*!
 @brief   Checks if IWDG test is in progress
 @param   None
 @return  true if IWDG test is in progress, false otherwise
*******************************************************************/
bool ClassB_IsTestingIWDG(void)
{
  return _IwdgDisabled;
}

/*******************************************************************/
/*!
 @brief   Marks that the next IWDG reset is expected from ClassB startup test
 @return  None
*******************************************************************/
void ClassB_MarkExpectedIWDGReset(void)
{
  _RtcBkupWrite(RTC_WDGEXPECT_MARKER_REG, _WdgExpectedMagic);
  _RtcBkupWrite(RTC_WDGEXPECT_MARKERINV_REG, ~_WdgExpectedMagic);

  // Make sure marker writes complete before intentionally expiring IWDG.
  __DSB();
  __ISB();
}

/*******************************************************************/
/*!
 @brief   Clears expected-IWDG-reset marker
 @return  None
*******************************************************************/
void ClassB_ClearExpectedIWDGReset(void)
{
  _RtcBkupWrite(RTC_WDGEXPECT_MARKER_REG, 0u);
  _RtcBkupWrite(RTC_WDGEXPECT_MARKERINV_REG, 0u);
}

/*******************************************************************/
/*!
 @brief   Returns true if expected-IWDG-reset marker is valid
 @return  Marker validity
*******************************************************************/
bool ClassB_IsExpectedIWDGReset(void)
{
  uint32_t marker = _RtcBkupRead(RTC_WDGEXPECT_MARKER_REG);
  uint32_t marker_inv = _RtcBkupRead(RTC_WDGEXPECT_MARKERINV_REG);

  return (marker == _WdgExpectedMagic) && (marker_inv == ~_WdgExpectedMagic);
}

/*******************************************************************/
/*!
 @brief   Classifies IWDG reset cause as expected (startup test) or unexpected
 @return  None
*******************************************************************/
void ClassB_WdgResetDiagnosticsInit(void)
{
  uint32_t reset_cause = GetResetCause();
  bool iwdg_was_reset = ((reset_cause & RCC_CSR_IWDGRSTF) != 0u);
  bool iwdg_expected = ClassB_IsExpectedIWDGReset();
  bool iwdg_test_inprogress = (_StartTestStatus[eClassBStartItem_IWDG] == TEST_CLASSB_INPROGRESS);
  tTask last_task = eTask_NUM;
  const char* last_task_name = NULLPTR;
  bool has_task_breadcrumb = TASK_GetLastRunningBeforeReset(&last_task, &last_task_name);

  if (iwdg_was_reset)
  {
    if (has_task_breadcrumb)
    {
      printf("IWDG breadcrumb: last task=%s (%u)\r\n", last_task_name, (unsigned)last_task);
    }
    else
    {
      printf("IWDG breadcrumb: last task=unknown\r\n");
    }
  }

  if (iwdg_was_reset && iwdg_expected && iwdg_test_inprogress)
  {
    EEPROM_MCU_IncrementReg(eEEPROM_Reg_WdgResetExpected);
    printf("ClassB WDG reset classified as EXPECTED (startup test)\r\n");
  }
  else if (iwdg_was_reset)
  {
    EEPROM_MCU_IncrementReg(eEEPROM_Reg_WdgResetUnexpected);
    printf("*** Unexpected IWDG reset (marker=%u, startup_iwdg=%u)\r\n",
           iwdg_expected ? 1u : 0u,
           iwdg_test_inprogress ? 1u : 0u);
  }
  else if (iwdg_expected && !iwdg_test_inprogress)
  {
    // Marker present without a matching startup-IWDG in-progress state indicates stale data.
    printf("*** Clearing stale expected-IWDG marker\r\n");
  }

  if ((iwdg_was_reset || iwdg_expected) && !iwdg_test_inprogress)
  {
    // Keep marker in place across the intentional startup reset path and clear otherwise.
    ClassB_ClearExpectedIWDGReset();
  }

