smq100/inish-stm32cube-template/Application/ClassB/src/classb.c
  if (iwdg_was_reset)
  {
    TASK_ClearLastRunningBeforeReset();
  }
}

/*******************************************************************/
/*!
 @brief   Records a watchdog heartbeat from a system source
 @param   SourceMask: OR-mask of CLASSB_WDG_HB_* sources
 @return  None
*******************************************************************/
void ClassB_WdgHeartbeat(uint32_t SourceMask)
{
  if (_StarveWdg)
  {
    _WdgHeartbeatMask = 0;
  }
  else
  {
    _WdgHeartbeatMask |= SourceMask;
  }
}

/*******************************************************************/
/*!
 @brief   Returns true when all required watchdog heartbeat sources are present
 @return  Feed permission
*******************************************************************/
bool ClassB_WdgCanRefresh(void)
{
  bool can_refresh = ((_WdgHeartbeatMask & CLASSB_WDG_HB_REQUIRED) == CLASSB_WDG_HB_REQUIRED);

  if (can_refresh)
  {
    // Clear only required heartbeat bits after one successful refresh opportunity.
    _WdgHeartbeatMask &= ~CLASSB_WDG_HB_REQUIRED;
  }

  return can_refresh;
}

/*******************************************************************/
/*!
 @brief   Prints the status of all startup tests
 @param   None
 @return  None
*******************************************************************/
void ClassB_PrintStatus(void)
{
  for (int i = 0; i < eClassBStartItem_NUM; i++)
  {
    const char* status_str;
    switch (_StartTestStatus[i])
    {
      case TEST_CLASSB_NOINIT:
        status_str = "PENDING";
        break;
      case TEST_CLASSB_INPROGRESS:
        status_str = "IN PROGRESS";
        break;
      case TEST_CLASSB_PASS:
        status_str = "PASS";
        break;
      case TEST_CLASSB_FAIL:
        status_str = "FAIL";
        break;
      case TEST_CLASSB_DISABLED:
        status_str = "DISABLED";
        break;
      default:
        status_str = "UNKNOWN";
        break;
    }
    printf("ClassB Startup test '%s': %s\n\r", _StartConfig[i].Name, status_str);
  }
}

/*******************************************************************/
/*!
 @brief   Detect if firmware was loaded via debugger vs flash programmer
 @param   None
 @return  true if loaded via debugger, false if flashed normally
*******************************************************************/
bool ClassB_LoadedViaDebugger(void)
{
  bool debugger_present;

  // Check if CRC reference is erased flash pattern. Linker sets REF_CRC32 to 0xFFFFFFFF
  uint32_t crc_value = *(uint32_t*)(&REF_CRC32);
  debugger_present = (crc_value == 0xFFFFFFFF);

  return debugger_present;
}

/*******************************************************************/
/*!
 @brief   Checks if a runtime test is Enabled
 @param   test : Test to check
 @return  true if test is Enabled, false otherwise
*******************************************************************/
bool ClassB_IsRuntimeTestEnabled(tClassBRunItem Test, char* Name)
{
  bool enabled = false;

  if (Test < eClassBRunItem_NUM)
  {
    enabled = _RunConfig[Test].Enabled;

    if (Name != NULLPTR)
    {
      strcpy(Name, _RunConfig[Test].Name);
    }
  }

  return enabled;
}

/*******************************************************************/
/*!
 @brief   Executed in case of failure is detected by one of self-test startup routines
 @param   test : Test that failed
 @return  None
*******************************************************************/
void ClassB_Fail_Startup(tClassBStartItem Test)
{
  printf("Startup test '%s' FAILED. Halting execution.\n\r", _StartConfig[Test].Name);

  while (true)
  {
#ifndef TEST__DISABLE_IWDG
    HAL_IWDG_Refresh(&hIWDG_APP);
#endif

    HAL_GPIO_TogglePin(LED_STATUS_GPIO_Port, LED_STATUS_Pin);
    HAL_Delay(100);
  }
}

/*******************************************************************/
/*!
 @brief   Executed in case of failure is detected by one of self-test runtime routines
 @param   test : Test that failed
 @return  None
*******************************************************************/
void ClassB_Fail_Runtime(tClassBRunItem Test)
{
  LOG_Write(eLogger_Sys, eLogLevel_Error, _Module, true, "Runtime test '%s' failed.", _RunConfig[Test].Name);

  // Flash the LED based on the test that failed. test+1 so test 0 pulses once.
#ifndef HW_IS_NUCLEO
  LED_Pulse(eLED_Error, 1.0f, -1, (int32_t)(Test + 1), "");
#else
  SYSTEM_SetStatusLED(eStatusLED_Error, (int8_t)(Test + 1));
#endif
}

/*******************************************************************/
/*!
 @brief   Executed in case of entering a runtime test. Used for control flow testing
 @return  None
*******************************************************************/
void ClassB_ControlFlowInit(void)
{
  ClassB_SetVar(eClassBVar_RUN_FLOW_CNT_U32, (tDataValue){ .U32 = 0u });
}

/*******************************************************************/
/*!
 @brief   Executed in case of entering a runtime test. Used for control flow testing
 @param   a : value to add to control flow counter
 @return  None
*******************************************************************/
void ClassB_ControlFlowEnter(uint32_t A)
{
  extern tDataValue ClassBData[];
  ClassBData[eClassBVar_RUN_FLOW_CNT_U32].U32 += A;
}

/*******************************************************************/
/*!
 @brief   Executed in case of exiting a runtime test. Used for control flow testing
 @param   a : value to subtract from control flow counter
 @return  None
*******************************************************************/
void ClassB_ControlFlowExit(uint32_t A)
{
  extern tDataValue ClassBDataInv[];
  ClassBDataInv[eClassBVar_RUN_FLOW_CNT_U32].U32 -= A;
}

/*******************************************************************/
/*!
 @brief   Returns the name of a runtime test
 @param   test : Test to get the name of
 @return  Name of the runtime test
*******************************************************************/
const char* ClassB_GetRuntimeName(tClassBRunItem Test)
{
  const char* name = NULLPTR;

  if (Test < eClassBRunItem_NUM)
  {
    name = _RunConfig[Test].Name;
  }

  return name;
}

/*******************************************************************/
/*!
 @brief   Runs the clock test, which measures the LSI period using
          TIM10 input capture and checks if it's within expected limits
 @param   startup : Indicates if the test is run during startup or runtime
 @return  Status of the clock test
*******************************************************************/
tClockStatus ClassB_RunCLKTest(bool Startup)
{
  tClockStatus clck_sts = TEST_ONGOING;

  ClassB_ControlFlowEnter(Startup ? FLOW_START_CLK2 : FLOW_RUNTIME_CLK2);

  __HAL_TIM_CLEAR_FLAG(&hTIM_CLKTEST, TIM_FLAG_CC1);
  if (HAL_TIM_IC_Start_IT(&hTIM_CLKTEST, TIM_CLKTEST_CH) == HAL_OK)
  {
    // Wait for two subsequent LSI periods measurements
    // Use sequence counter approach to ensure we capture fresh measurements
    // and avoid race conditions with the timer interrupt updating the flags

    uint32_t start_count = ClassB_GetVar(eClassBVar_RUN_LSI_PERIOD_FLAG_V32).V32;

