smq100/inish-stm32cube-template/Application/ClassB/src/classb.c
    // Wait for first new measurement (flag increment)
    uint32_t timeout = TIMER_GetTick() + 150u;  // 150 ms timeout
    while (ClassB_GetVar(eClassBVar_RUN_LSI_PERIOD_FLAG_V32).V32 == start_count)
    {
      if (TIMER_GetTick() > timeout)
      {
        LOG_Write(eLogger_Sys, eLogLevel_Error, _Module, true, "CLK test timeout waiting for LSI period 1");
        clck_sts = MCO_START_TIM_FAIL;
        break;
      }
    }

    if (clck_sts == TEST_ONGOING)
    {
      start_count = ClassB_GetVar(eClassBVar_RUN_LSI_PERIOD_FLAG_V32).V32;

      // Wait for second new measurement (another flag increment)
      timeout = TIMER_GetTick() + 150u;  // 150 ms timeout
      while (ClassB_GetVar(eClassBVar_RUN_LSI_PERIOD_FLAG_V32).V32 == start_count)
      {
        if (TIMER_GetTick() > timeout)
        {
          LOG_Write(eLogger_Sys, eLogLevel_Error, _Module, true, "CLK test timeout waiting for LSI period 2");
          clck_sts = MCO_START_TIM_FAIL;
          break;
        }
      }
    }

    uint32_t period = ClassB_GetVar(eClassBVar_RUN_LSI_PERIOD_VALUE_V32).V32;

    // LSI_MEASURE_PRESCSALER must the same as TIM10_CLK_TEST_FREQ IC prescaler
    const uint32_t limit_low = SYS_LIMIT_LOW(SYSCLK_AT_RUN);
    const uint32_t limit_high = SYS_LIMIT_HIGH(SYSCLK_AT_RUN);

    if (_FaultInjection[eClassBRunItem_CLK] && !Startup)
    {
      // Force clock failure by injecting out-of-range value
      period = limit_high + 1000uL;
      _FaultInjection[eClassBRunItem_CLK] = false;
    }

    // Assign status
    if (clck_sts == MCO_START_TIM_FAIL)
    {
      // Already failed to get LSI periods
    }
    else if (period < limit_low)
    {
      // Below expected
      LOG_Write(
        eLogger_Sys, eLogLevel_Error, _Module, true, "CLK test FAIL: period %lu below limit %lu", period, limit_low);
      clck_sts = SYSCLK_LOW;
    }
    else if (period > limit_high)
    {
      LOG_Write(
        eLogger_Sys, eLogLevel_Error, _Module, true, "CLK test FAIL: period %lu above limit %lu", period, limit_high);
      clck_sts = SYSCLK_HIGH;
    }
    else
    {
      LOG_Write(eLogger_Sys,
                eLogLevel_Low,
                _Module,
                true,
                "CLK test PASS: period %lu within limits %lu/%lu",
                period,
                limit_low,
                limit_high);

      clck_sts = FREQ_OK;
    }
  }
  else
  {
    LOG_Write(eLogger_Sys, eLogLevel_Error, _Module, true, "CLK test FAIL: unable to start timer");
    clck_sts = MCO_START_TIM_FAIL;
  }

  // Stop timer after test completes
  HAL_TIM_IC_Stop_IT(&hTIM_CLKTEST, TIM_CLKTEST_CH);

  ClassB_ControlFlowExit(Startup ? FLOW_START_CLK2 : FLOW_RUNTIME_CLK2);

  return clck_sts;
}

/*******************************************************************/
/*!
 @brief   Run ADC test
 @param   startup : Indicates if the test is run during startup or runtime
 @return  Status of the test
*******************************************************************/
bool ClassB_RunADCTest(bool Startup)
{
  bool success = true;
  uint16_t vref_raw = 0u;
  uint16_t temp_raw = 0u;

  if (Startup)
  {
    MX_ADC_Init();
  }

  // Stop any active DMA conversion before reconfiguring.
  // This does not disturb the DMA peripheral itself or the DMA handle link.
  (void)HAL_ADC_Stop_DMA(&hADC_APP);

  // Switch temporarily to single-channel polling mode so we can read VREFINT and
  // TEMPSENSOR without touching any TGEN state or DMA buffers.
  // HAL_ADC_Init() skips MspInit (and therefore does not touch the DMA link) when
  // the handle state is not HAL_ADC_STATE_RESET, which is the case here.
  hADC_APP.Init.ScanConvMode = ADC_SCAN_DISABLE;
  hADC_APP.Init.NbrOfConversion = 1u;
  hADC_APP.Init.EOCSelection = ADC_EOC_SINGLE_CONV;

  if (HAL_ADC_Init(&hADC_APP) != HAL_OK)
  {
    if (Startup)
    {
      printf("ADC test FAIL: unable to reconfigure ADC\r\n");
    }
    else
    {
      LOG_Write(eLogger_Sys, eLogLevel_Error, _Module, true, "ADC test FAIL: unable to reconfigure ADC");
    }
    success = false;
  }

  // Read VREFINT
  if (success)
  {
    ADC_ChannelConfTypeDef ch = { 0 };
    ch.Channel = ADC_CHANNEL_VREFINT;
    ch.Rank = ADC_REGULAR_RANK_1;
    ch.SamplingTime = ADC_SAMPLETIME_384CYCLES;

    if (HAL_ADC_ConfigChannel(&hADC_APP, &ch) != HAL_OK || HAL_ADC_Start(&hADC_APP) != HAL_OK ||
        HAL_ADC_PollForConversion(&hADC_APP, 10u) != HAL_OK)
    {
      if (Startup)
      {
        printf("ADC test FAIL: VREFINT read error\r\n");
      }
      else
      {
        LOG_Write(eLogger_Sys, eLogLevel_Error, _Module, true, "ADC test FAIL: VREFINT read error");
      }
      success = false;
    }
    else
    {
      vref_raw = (uint16_t)HAL_ADC_GetValue(&hADC_APP);
      (void)HAL_ADC_Stop(&hADC_APP);
    }
  }

  // Read TEMPSENSOR
  if (success)
  {
    ADC_ChannelConfTypeDef ch = { 0 };
    ch.Channel = ADC_CHANNEL_TEMPSENSOR;
    ch.Rank = ADC_REGULAR_RANK_1;
    ch.SamplingTime = ADC_SAMPLETIME_384CYCLES;

    if (HAL_ADC_ConfigChannel(&hADC_APP, &ch) != HAL_OK || HAL_ADC_Start(&hADC_APP) != HAL_OK ||
        HAL_ADC_PollForConversion(&hADC_APP, 10u) != HAL_OK)
    {
      if (Startup)
      {
        printf("ADC test FAIL: TEMPSENSOR read error\r\n");
      }
      else
      {
        LOG_Write(eLogger_Sys, eLogLevel_Error, _Module, true, "ADC test FAIL: TEMPSENSOR read error");
      }
      success = false;
    }
    else
    {
      temp_raw = (uint16_t)HAL_ADC_GetValue(&hADC_APP);
      (void)HAL_ADC_Stop(&hADC_APP);
    }
  }

  // Restore the full 5-channel scan+DMA configuration unconditionally so that
  // TGEN ADC DMA reads work correctly regardless of test outcome.
  MX_ADC_Init();

  // Validate
  if (success)
  {
    int16_t vdda_mv = CalcVDDA_mv(vref_raw);
    int16_t temp_decic = CalcCoreTemp_Cx10(temp_raw, vref_raw);

    if (vdda_mv < CLASSB_ADC_VREF_LOW_MV || vdda_mv > CLASSB_ADC_VREF_HIGH_MV)
    {
      if (Startup)
      {
        printf("ADC test FAIL: Vref %d mV out of range [%d, %d]\r\n",
               vdda_mv,
               CLASSB_ADC_VREF_LOW_MV,
               CLASSB_ADC_VREF_HIGH_MV);
      }
      else
      {
        LOG_Write(eLogger_Sys,
                  eLogLevel_Error,
                  _Module,
                  true,
                  "ADC test FAIL: Vref %d mV out of range [%d, %d]",
                  vdda_mv,
                  CLASSB_ADC_VREF_LOW_MV,
                  CLASSB_ADC_VREF_HIGH_MV);
      }

      success = false;
    }

    if (temp_decic < CLASSB_ADC_TEMP_LOW_DECIC || temp_decic > CLASSB_ADC_TEMP_HIGH_DECIC)
    {
      if (Startup)
      {
        printf("ADC test FAIL: MCU temp %d deci-C out of range [%d, %d]\r\n",
               temp_decic,
               CLASSB_ADC_TEMP_LOW_DECIC,
               CLASSB_ADC_TEMP_HIGH_DECIC);
      }
      else
      {
        LOG_Write(eLogger_Sys,
                  eLogLevel_Error,
                  _Module,
                  true,
                  "ADC test FAIL: MCU temp %d deci-C out of range [%d, %d]",
                  temp_decic,
                  CLASSB_ADC_TEMP_LOW_DECIC,
                  CLASSB_ADC_TEMP_HIGH_DECIC);
      }

      success = false;
    }

    if (success)
    {
      LOG_Write(eLogger_Sys,
                eLogLevel_Low,
                _Module,
                false,
                "ADC test PASS: vref_raw=%u temp_raw=%u Vref=%.2fV MCU temp=%.1fC",
                vref_raw,
                temp_raw,
                vdda_mv / 1000.0f,
                temp_decic / 10.0f);
    }
  }

  return success;
}

/*******************************************************************/
/*!
 @brief   Prints the error counts for all runtime tests by reading from EEPROM registers
 @return  None
*******************************************************************/
void ClassB_PrintErrorCounts(void)
{
  uint32_t cpu_errors = 0;
  uint32_t ram_errors = 0;
  uint32_t crc_errors = 0;
  uint32_t adc_errors = 0;
  uint32_t clk_errors = 0;
  uint32_t wdg_errors = 0;
  uint32_t stack_errors = 0;
  uint32_t flow_errors = 0;
  uint32_t wdg_expected_resets = 0;
  uint32_t wdg_unexpected_resets = 0;

  EEPROM_MCU_ReadReg(eEEPROM_Reg_ClassBError_CPU, &cpu_errors);
  EEPROM_MCU_ReadReg(eEEPROM_Reg_ClassBError_RAM, &ram_errors);
  EEPROM_MCU_ReadReg(eEEPROM_Reg_ClassBError_CRC, &crc_errors);
  EEPROM_MCU_ReadReg(eEEPROM_Reg_ClassBError_ADC, &adc_errors);
  EEPROM_MCU_ReadReg(eEEPROM_Reg_ClassBError_CLK, &clk_errors);
  EEPROM_MCU_ReadReg(eEEPROM_Reg_ClassBError_WDG, &wdg_errors);
  EEPROM_MCU_ReadReg(eEEPROM_Reg_ClassBError_Stack, &stack_errors);
  EEPROM_MCU_ReadReg(eEEPROM_Reg_ClassBError_Flow, &flow_errors);
  EEPROM_MCU_ReadReg(eEEPROM_Reg_WdgResetExpected, &wdg_expected_resets);
  EEPROM_MCU_ReadReg(eEEPROM_Reg_WdgResetUnexpected, &wdg_unexpected_resets);

  LOG_Write(eLogger_Sys,
            eLogLevel_High,
            _Module,
            true,
            "ClassB Errors: CPU=%lu, RAM=%lu, CRC=%lu,  ADC=%lu, CLK=%lu, WDG=%lu, STK=%lu, FLO=%lu",
            cpu_errors,
            ram_errors,
            crc_errors,
            adc_errors,
            clk_errors,
            adc_errors,
            wdg_errors,
            stack_errors,
            flow_errors);

  LOG_Write(eLogger_Sys,
            eLogLevel_High,
            _Module,
            false,
            "WDG resets: expected=%lu unexpected=%lu",
            wdg_expected_resets,
            wdg_unexpected_resets);
}

/* Private Implementation ----------------------------------------------------*/

static uint32_t _RtcBkupRead(uint32_t BackupRegister)
{
  assert_param(IS_RTC_BKP(BackupRegister));

  uint32_t tmp = (uint32_t)&(RTC->BKP0R);
  tmp += (BackupRegister * 4u);

  return (*(__IO uint32_t*)tmp);
}

static void _RtcBkupWrite(uint32_t BackupRegister, uint32_t Data)
{
  assert_param(IS_RTC_BKP(BackupRegister));

  uint32_t tmp = (uint32_t)&(RTC->BKP0R);
  tmp += (BackupRegister * 4u);

  *(__IO uint32_t*)tmp = Data;
}

/* Protected functions ------------------------------------------------------ */

#ifdef CLASSB_PROTECTED

/*******************************************************************/
/*!
 @brief   Sets a fault for a specific runtime test
 @param   Test : The runtime test to set the fault for
 @return  Success status of the operation
*******************************************************************/
bool ClassB__SetFault(tClassBRunItem Test)
{
  bool success = false;

  if (Test < eClassBRunItem_NUM)
  {
    _FaultInjection[Test] = true;
    LOG_Write(eLogger_Sys, eLogLevel_High, _Module, false, "Fault injection set for test '%s'", _RunConfig[Test].Name);
    success = true;
  }

  return success;
}

/*******************************************************************/
/*!
 @brief   Clears a fault for a specific runtime test
 @param   Test : The runtime test to clear the fault for
 @return  Success status of the operation
*******************************************************************/
bool ClassB__ClearFault(tClassBRunItem Test)
{
  bool success = false;

  if (Test < eClassBRunItem_NUM)
  {
    _FaultInjection[Test] = false;
    LOG_Write(
      eLogger_Sys, eLogLevel_High, _Module, false, "Fault injection cleared for test '%s'", _RunConfig[Test].Name);
    success = true;
  }

  return success;
}

/*******************************************************************/
/*!
 @brief   Gets the fault status for a specific runtime test
 @param   Test : The runtime test to get the fault status for
 @return  Fault status of the operation
*******************************************************************/
bool ClassB__GetFault(tClassBRunItem Test)
{
  bool fault = false;

  if (Test < eClassBRunItem_NUM)
  {
    fault = _FaultInjection[Test];
  }

  return fault;
}

/*******************************************************************/
/*!
 @brief   TIM Input Capture callback. Measures LSI period for CLK testing
 @param   htim : TIM handle
 @return  None
 @note    Use inline and read/Write data directly to ClassB vars for ISR effiency
*******************************************************************/
void ClassB__IC_Callback(TIM_HandleTypeDef* Htim)
{
  assert_param(Htim->Instance == hTIM_CLKTEST.Instance);

  // Read/Write data directly to ClassB vars for ISR effiency
  extern tDataValue ClassBData[];
  extern tDataValue ClassBDataInv[];

  static uint32_t prev = 0;
  uint32_t now = HAL_TIM_ReadCapturedValue(Htim, TIM_CLKTEST_CH);

  uint32_t period;
  if (now >= prev)
    period = now - prev;
  else
    period = (Htim->Instance->ARR - prev + 1u) + now;  // timer overflow

  uint32_t period_inv = ~period;
  uint32_t flag = ClassBData[eClassBVar_RUN_LSI_PERIOD_FLAG_V32].V32 + 1u;
  uint32_t flag_inv = ~flag;

  ClassBData[eClassBVar_RUN_LSI_PERIOD_VALUE_V32].V32 = period;
  ClassBDataInv[eClassBVar_RUN_LSI_PERIOD_VALUE_V32].V32 = period_inv;
  ClassBData[eClassBVar_RUN_LSI_PERIOD_FLAG_V32].V32 = flag;
  ClassBDataInv[eClassBVar_RUN_LSI_PERIOD_FLAG_V32].V32 = flag_inv;

  prev = now;
}

#endif /* CLASSB_PROTECTED */
